{
  "architectures": [
    "AlbertForImageCaptioning"
  ],
  "attention_probs_dropout_prob": 0.1,
  "hidden_act": "gelu_new",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "max_position_embeddings": 512,
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "type_vocab_size": 2,
  "vocab_size": 30522,
  "model_type": "albert",
  "embedding_size": 128,
  "num_hidden_groups": 1,
  "inner_group_num": 1,
  "classifier_dropout_prob": 0.1,
  "output_attentions": false,
  "output_hidden_states": false,
  "layer_norm_eps": 1e-12,
  "img_feature_dim": 512,
  "img_feature_type": "frcnn",
  "use_img_layernorm": true,
  "img_layer_norm_eps": 1e-12
}